import {v4 as uuidev4} from 'uuid'
import * as React from 'react';
import { Grid, Button, Box, Typography, Card, CardContent, Dialog ,DialogTitle,DialogContent ,DialogActions} from '@mui/material';
import MenuBookOutlinedIcon from '@mui/icons-material/MenuBookOutlined';
import { Link } from 'react-router-dom';
import '../App.css';
import { styled } from '@mui/material/styles';
import IconButton from '@mui/material/IconButton';
import CloseIcon from '@mui/icons-material/Close';
import InstagramIcon from '@mui/icons-material/Instagram';

const quotes=[   {id:uuidev4(),title:"وَفِّر بَريقَ سَيفِكَ لِمَعركَةٍ تَسْتَحِق",yazar:"يوسف الدموكي"},   {id:uuidev4(),title:"ليس شيئ أوعظ من قبر، ولا أسلم من وحدة،ولا أنس من كتاب",yazar:"من أقوال الحكماء"},  {id:uuidev4(),title:"ولقد جربت اللّذائذ كلها فما وجدت أمتع من الخلوة بكتاب، وإذا كان للناس ميول وكانت لهم رغبات، فإن الميل إلى المطالعة والرغبة فيها هي أفضلها",yazar:"علي الطنطاوي"}, {id:uuidev4(),title:" كُلما اِستعملتُ القُرآن رَأيتُ الشّفَاء في نَفسي، فإذَا ابتعدتُ عنهُ عَادت إليّ أسقامي",yazar:"د. إبراهيم السّكرَان"},  {id:uuidev4(),title:"أعقل الناس من كان بعيبه بصيرا، وعن عيب غيره ضريرا",yazar:" الإمام علي"},  {id:uuidev4(),title:"وإنّ فهم الكتاب والسنّة فرض، ولا يفهم إلّا بفهم اللغة العربيّة، وما لا يتمّ الواجب إلّا به فهو واجب",yazar:" ابن تيمية"},    {id:uuidev4(),title:"لَعَمرُكَ ما الأَبصارُ تَنفَعُ أَهلَها ...إِذا لَم يَكُن لِلمُبصِرينَ بَصائِرُ",yazar:"أبو فراس الحمداني"},    {id:uuidev4(),title:"إذا المرءُ أَعْيَتُه المروءةَ ناشِئًا ... فَمَطْلَبُها كَهْلاً عليه شَدِيدُ",yazar:"المخيل السعدي"},    {id:uuidev4(),title:"وتأنَسُ النّفسُ في نفْسٍ توافِقُها ... بالفكرِ والطّبعِ والغاياتِ والقيمِ",yazar:"من أقوال الحكماء"},     {id:uuidev4(),title:"َتعَلَّمُوا الْعَرَبِيَّةَ ؛ فَإِنَّهَا تُثَبِّتُ الْعَقْلَ ، وَتَزِيدُ فِي الْمُرُوءَةِ",yazar:"عمر بن الخطاب"},     {id:uuidev4(),title:"الدنيا منتقلة فانية، إن بقيت لك لم تبق لها",yazar:" الإمام علي"},      {id:uuidev4(),title:"لقد تعلمنا في المدرسة ونحن صغار أن السنبلة الفارغة ترفع رأسها في الحقل، وأن الممتلئة بالقمح تخفضه، فلا يتواضع إلا كبير، ولا يتكبر إلا حقير.",yazar:"علي الطنطاوي"}, {id:uuidev4(),title:"لا تسخر، ولا تستصغر، ولا تهزأ بالناس..فلا تعلم كيف سيكون حالك غداً",yazar:"علي الطنطاوي"},  {id:uuidev4(),title:"كل شيء بقدر الله، والله قسم للعبد سعادته وشقائه ورزقه وعمره، فما كان لك سوف يأتيك على ضعفك، وما كان لغيرك لن تناله بقوتك",yazar:"علي الطنطاوي"},  {id:uuidev4(),title:"كن صابراً في كل شيء ، حتى في الوجع ، قل الحمد لله دوماً ، فكم من صدر ضاق ثم برحمة الله اتسع",yazar:"علي الطنطاوي"},  {id:uuidev4(),title:"فِي لحظةٍ لا تَتوقَّعها ستجدُ نفسكَ وسطَ حُلمِكَ الذي طَالمَا أردتَهُ وَتَمَنَّيتَه، فَلا تفقدِ الأملَ أبدًا وَثِق بالله",yazar:"علي الطنطاوي"},   {id:uuidev4(),title:"الحياة أوسع من أن تتمسك بشيء، ظناً منك بأنه قد لا يتكرر",yazar:"غازي القصيبي"},    {id:uuidev4(),title:"إن انشغلت برأي الآخرين ضيعت راحتك وأهدافك.",yazar:"غازي القصيبي"},    {id:uuidev4(),title:"يبحث عن رضا الناس من لا يرضى عن نفسه.",yazar:"عبد الوهاب الرفاعي"},{id:uuidev4(),title:" إسعى إلى ما يلفت قلبك، ليس ما يلفت عينك",yazar:"جلال الدين الرومي"},{id:uuidev4(),title:"أن تفشل في الإبداع، أفضل من أن تنجح في التقليد",yazar:"هيرمان ميلفيل"}, {id:uuidev4(),title:"سيصادفك شيء طلبته من الله منذ زمن بعيد ربما نسيته لكن الله لم ينساه",yazar:"الشعراوي"},    {id:uuidev4(),title:" لا تعبدوا الله ليعطى بل اعبدوه ليرضى فإن رضى أدهشكم بعطائه",yazar:"الشعراوي"},      {id:uuidev4(),title:"لا أحد سابقُكَ ولا أنت بسابقٍ أحد، كُل يسير لقدره",yazar:"الشعراوي"},    {id:uuidev4(),title:"لن تحصل أبدا على شيء كامل...ستحصل على أشياء ناقصة  ...تكتمل برضاك عنها..هي القناعة والاقتناع.",yazar:"الشعراوي"},    {id:uuidev4(),title:"ان رضيت؛ هان عليك مُصابك، واتّسعت رحمة الله في فؤادك، ورأيت من حولك يركضون متخبّطين، وأنت تغشاك السكينة.",yazar:"الشعراوي"},    {id:uuidev4(),title:"القراءة ليست نزهةً ذهنية، بل هي سُلَّمٌ نتسلق به إلى مراتب أعلى من الفهم والنظر.",yazar:"إبراهيم السكران"},    {id:uuidev4(),title:"حين تستقرّ في قلبك حقيقة أنك عبدٌ لله، تهون في عينيك الدنيا وما فيها.",yazar:" نجيب الكيلاني"},    {id:uuidev4(),title:"إن أعظم ما نحتاجه في الشرق ليس المال ولا العلم، بل النفس الكبيرة، والإيمان العميق.",yazar:" أمين الريحاني"},   
    {id:uuidev4(),title:"كُنّا حيارى في الظَّلام فَأشرَقَ تْ…  شَمْسُ الهِدايةِ يوم لاحَ سناكَ ﷺ",yazar:"من أقوال العلماء"},  {id:uuidev4(),title:"لى المرء أن يواجه مخاوفه.ليس ليقلّ خوفه، بل ليزداد شجاعة.هذا هو الفرق؛ الخوف لا يزال موجودًا، لكن القدرة على مواجهته والنجاح هيّٰ مصدر قوتكِ.",yazar:"د. محمد عبدُ الجواد."},  {id:uuidev4(),title:"أتيْناك بالفقرِ…يا ذا الغِنىٰ…وأنتَ الذي…لم تزَلْ مُحسنا",yazar:"من أقوال العلماء"},  {id:uuidev4(),title:"إنما الدُّنيا خَيالٌ باطلٌ سوفَ يَفُوت… ليسَ للإنسانِ فيها  غيرَ تقوى اللهِ قُوت!",yazar:"من أقوال العلماء"},  {id:uuidev4(),title:"الدُّنيا وُضعت للبلاء ، فينبغي للعَاقل أن يُوطِّنَ نفسَه عَلى الصَّبر.",yazar:"ابن الجوزي."}, 
 {id:uuidev4(),title:"الحرية لا تُوهب، بل تُنتزع، وكل أمة تنال من الحرية بمقدار ما تأخذ لا بمقدار ما تُعطى.",yazar:" عبد الرحمن الكواكبي"},    {id:uuidev4(),title:"ليست السعادة أن تصل، بل أن تسير في الطريق الصحيح وأنت تؤمن أن في نهاية الطريق نورًا.",yazar:" أنيس منصور"},      {id:uuidev4(),title:"الفكر هو ما يجعل الإنسان إنسانًا، فإذا سكت الفكر، ماتت الروح حتى وإن ظل الجسد حيًا.",yazar:" إحسان عبد القدوس"},      {id:uuidev4(),title:"من عرف الله، اطمأن قلبه، واستراح فكره، وسكنت روحه، ولو تقلبت به الدنيا كل يوم ألف مرة.",yazar:" علي الطنطاوي"},      {id:uuidev4(),title:"التربية ليست تلقين معلومات، بل بناء أرواح وعقول قادرة على حمل الرسالة.",yazar:"عبد الكريم بكار "},      {id:uuidev4(),title:"الحكمة لا تأتي عن طريق الكتب وحدها، ولكن تأتي عن طريق التجربة.",yazar:" الكونت دي بوفون"},  {id:uuidev4(),title:"إن لم نكن نحن مَن نصنع المستحيل، فهل نحن في مكانٍ لنعيش؟",yazar:"خالد بن الوليد"},   {id:uuidev4(),title:"من لزم الكتاب وسنة النبي صلى الله عليه وسلم تاهت الأوهام عنه.",yazar:"أحمد بن حنبل"},   {id:uuidev4(),title:"لا يهم كم هي الكتب التي تقرأها، الأهم هو كيف تؤثر عليك.",yazar:"ماري آن إيفانس"},   {id:uuidev4(),title:"الكتاب هو الفرصة التي تعطيك إياه الحياة لتعيش ألف حياة.",yazar:" جيمس هاريسون"},  {id:uuidev4(),title:"الكتب هي الطيور التي تطير بنا إلى أماكن لا يمكننا الوصول إليها.",yazar:" إنجريد بيرجمان"}, {id:uuidev4(),title:"عندما تفتح كتابًا، فإنك تفتح نافذة على عالم جديد.",yazar:"مايا أنجيلو"},   {id:uuidev4(),title:"كل كتاب هو نافذة تفتح على عالم جديد، وكلما قرأت أكثر، كلما عرفت نفسك أكثر.",yazar:"خليل جبران"}, {id:uuidev4(),title:"الكتاب هو أعظم هدية يمكن أن يقدمها المرء لنفسه، لأنه أفضل معلم وأصدق رفيق.",yazar:"مارك توين"},  {id:uuidev4(),title:"الكتب لا تمنحك الأجوبة دائمًا، لكنها تعطينا الفرصة للتساؤل.",yazar:"سارة نيلسون"},  {id:uuidev4(),title:"الكتاب الجيد هو صديق لا يخونك أبدًا، يظل معك ويعلمك المزيد كلما قرأت.",yazar:"إميلي ديكنسون"},  {id:uuidev4(),title:"القراءة هي مغامرة واحدة عظيمة، إنها الفضاء الذي يسافر فيه العقل.",yazar:" جورج آر. آر. مارتن"},  {id:uuidev4(),title:"عندما تقرأ، ليس مجرد الكلمات التي تأخذها، بل العالم بأسره الذي تأخذه معك.",yazar:"هاريتر بيترسون"},{id:uuidev4(),title:"القراءة هي المغامرة الأولى التي يمكنك أن تشارك فيها دون مغادرة المنزل.",yazar:"والت ديزني"},  {id:uuidev4(),title:"إن الله يحب العبد المفتن التواب، وهو الذي كلما فُتِن بالذنب تاب منه",yazar:"ابن القيم"},  {id:uuidev4(),title:"وألِنِ القُلوبَ مِن أجلي وألنِّي، واجبُر بَعد الصّبرِ قلبي، واقبضني وأنتَ راضٍ عنِّي",yazar:"الرافعيّ"},  {id:uuidev4(),title:"قال ابن مسعود رضي الله عنه: والله الذي لا إله غيره، لا يُحسن عبدٌ بالله ظنه، إلا أعطاه الله إياه .",yazar:"شعب الإيمان"},  {id:uuidev4(),title:"قد يدعو العبدُ ربَّه في حاجة، فيفتح اللهُ عليه من لذَّة مناجاته ما كان أحبَّ إليه من تلك الحاجة.",yazar:" ابن تيمية"},  {id:uuidev4(),title:"الدُعاء لا يذهب سُدى، لكن لله حكمة في وقت الإجابة، فيجب إحسان الظن به، فقد حُوصر النبي صلى الله عليه وسلم بمكة؛ فلم يرتفع كربه إلا بعد ثلاث سنين وهو خير الخلق.",yazar:"عبدالعزيز الطريفي"},  {id:uuidev4(),title:"رُبَّما كانَ الفتى باسِمًا، وكانَ كلُّ الهمِّ في قلبهِ.",yazar:"الرَّافعيّ"},  {id:uuidev4(),title:"ليس دوماً يُبتلى الإنسان ليُعذّب، وإنما قد يبتلى ليهذّب",yazar:"ابن القيم"},  {id:uuidev4(),title:"بابُ الاطمئنانِ والطَّريقُ إلى بلوغِ حلاوةِ الإيمانِ هو الدُّعاءُ، ادعُ اللهَ دائمًا، واسأَلْه ما جَلَّ ودَقَّ مِن حاجاتِكَ.",yazar:"علي طنطاوي"},  {id:uuidev4(),title:"لم أصادف شخصًا مهذَّبًا إلَّا رأيته مُعذَّبًا بالألم والمعاناة والحساسية النَّفسية، دائمًا يأتيني الفضول أن أُلقي نظرةً على كواليس هذا الجمال فاكتشفتُ أنَّ أغلبهم هذَّبَ الوجع أرواحهم!",yazar:"علي الطّنطاويّ"}, 
     {id:uuidev4(),title:"لو خالف العبد جميع الخلق واتبع الرسول ﷺ، ما سأله الله عن مخالفة أحد. ",yazar:"شيخ الإسلام ابن تيمية."},  {id:uuidev4(),title:"هَا أنتَ جَرَّبتَ الغَفلَة، أَمَا آنَ لَكَ أَنْ تَعُود؟",yazar:"ابنُ الجَوزِي"},  {id:uuidev4(),title:"طُوبَىٰ لِمَن اسْتَوْحَشَ مِنَ النَّاس، وَكَانَ اللّه أَنِيسَهُ، وَبَكَىٰ عَلَىٰ خَطِيئَتهُ!",yazar:"الفضيل بن عياض"},  {id:uuidev4(),title:"لو عرفتَ قدركَ يا مسكِين، ما ألقيتَ جوهرةَ قلبِك في مَزَابِل الهوىٰ",yazar:"ابن الجوزي"}, {id:uuidev4(),title:"وكل ما يصدر عن الله جميل، وإن كنا لا نرى الجمال في المصيبة.",yazar:"ابن القيم"},  {id:uuidev4(),title:"مَن صلَّى على النبيِّ ﷺ فليُظهِر أحرفَ الصَّلاةِ والسَّلامِ عليه، ولا يُسرع سُرعةً تُسقِطُ حروفَها فلا بركةَ في سُرعةٍ تُفسِدُ عبادةً يُتقرَّبُ بها لله، ويُعظَّمُ بها جنابُ النبيِّ ﷺ.",yazar:"العُصَيمِي"},  {id:uuidev4(),title:"إذا تأملت السبعة الذين يظلهم الله عز وجل في ظل عرشه يوم لا ظل إلا ظله وجدتهم إنما نالوا ذلك الظل بمخالفة الهوى",yazar:"ابن القيم"},  {id:uuidev4(),title:"و من كانُ كثيرُ الذنوبِ…فأعظمُ دوائهِ الجِهاد.",yazar:"ابنُ تيميَّة -رحمهُ اللّٰه"},  {id:uuidev4(),title:" صبرَ على مخالفة نفسه أوصله الله إلى مقام أُنسه",yazar:"محمد بن أحمد بن سالم البصري"}, {id:uuidev4(),title:"مالي إليكَ وَسيلةٌ إلَّا الرجا... وجَميلُ عفوِكَ... ثُم إنِّي مُسْلمُ.",yazar:"أبو نواس"},  {id:uuidev4(),title:"وإذا كان غير الله للمرء عُدةً…أتته الرزايا في وجوه المكاسب",yazar:"أبو فراس الحمداني"},  {id:uuidev4(),title:" فتى جاهدَ الدُّنيا وجاهد أهلَها…وفي نفسهِ لم يَدرِ كيف يجاهدُ!",yazar:"الرافعيّ"},  {id:uuidev4(),title:"العلم يشرح الصدر، ويوسعه حتى يكون أوسع من الدنيا، فكلما اتسع علم العبد انشرح صدره واتسع.",yazar:"ابن القيّم"},  {id:uuidev4(),title:"أشدُّ ما يورث إنسانٌ إنسانًا أن يُلبِسه الخوفَ منه فلا يأمن غضبه وتقلبات نفسه.وأعظم ما يكسو إنسانٌ إنسانًاأن يهبه أمنًا لا يتلون، ويقينا فيه لا يتبدل",yazar:"وجدان العلي."},  {id:uuidev4(),title:"وكان عِقابُ اللَّه لي غليظًا شديدًا، يومَ تركني لنفسي.",yazar:"من أقوال العلماء"},  {id:uuidev4(),title:"الاحتساب في سبيل اللَّه يُهَوِّن مصاعب الطّريق.",yazar:"الشيخ حسين عبد الرازق"}, 
  {id:uuidev4(),title:"و إنْ فرقتنا دروبُ الأمانِي…فقد نلتقِي صدفةً فِي قصِيدة!.",yazar:"فَاروق جُويدة"}, {id:uuidev4(),title:"وإن طالَ في العُمرِ ليلُ العناء…فظني جميلٌ بربّ السماء!",yazar:"من أقوال العلماء"},  {id:uuidev4(),title:"ستُشرق الشمس مهما طال مغربها…ويُهزَم الهم مَصحوبًا بخِذلانٍ.",yazar:"من أقوال العلماء"},  {id:uuidev4(),title:"وهو مني كالسعادة، إن لم أطمع في نيلِها،لم أيـأس من قُربِهـا ولا من الفكـرِ فيها.",yazar:"الرافعي"},  {id:uuidev4(),title:"لو يعلمُ الخلقُ ما للّٰهِ من كرمٍ… لأفنوا العُمر في أفضالهِ طَلَبا.",yazar:"من أقوال العلماء"},  {id:uuidev4(),title:"ما أمرّ عذاب من وجد الضروري له مستحيلاً عليه!",yazar:"الرافعي"},  {id:uuidev4(),title:"إِذا غامَرتَ في شَرَفٍ مَرومٍ…فَلا تَقنَع بِما دونَ النُجومِ…فَطَعمُ المَوتِ في أَمرٍ صَغيرٍ…كَطَعمِ المَوتِ في أَمرٍ عَظيمِ.",yazar:"المتنبي"},  {id:uuidev4(),title:"وَاللَهُ أَرحَمُ بِالفَتى مِن نَفسِهِ…فَاعمَل فَما كُلِّفتَ ما لَم تَستَطِع.",yazar:"أبو العتاهية"},  {id:uuidev4(),title:"مشكلة الإنسان أنّهُ يُريد أن يحيا حياة الجَنّة على الأرض،حيثُ لا كَدَر ولا ظمأ ؛ فيُغالِب ما قُدِّر وكُتِب؛ فيظلِم نفسه وغيره!",yazar:"سعد خضر"},  {id:uuidev4(),title:"مَا تابَ عبدٌ لله إلا وامتحن اللهُ صدقَ توبتهِ بتسهيل السبيل للذنب الذي تاب منه !!",yazar:"الشنقيطي."},  {id:uuidev4(),title:"خَفَّف اللَّه عن الإنسَان فأودَع فِيه قُوةالتخَيل يَسترِيح إليهَا من الحقَائِق.",yazar:"الرافعي"},  {id:uuidev4(),title:"أولى مراحل ضبط النفس عِلمُك أنها لن تَنضبطَأبدًا، وأنّك معها في توجيه دائم وتقويمٍ مستمر.. على هذا فُطِرَت، وعلى هذا سَتَبقى..فلا تجزع من الميلِ جزع اليائس، ولا تَغُرنَّك الاستقامة غرور الآمن..!",yazar:"من أقوال العلماء"},  {id:uuidev4(),title:"إنّ المرء ليجهد نفسه في أمر الدّنيا، وهو مكتوب في كتابه ميّت في قابل أيامه القلائل!",yazar:"محمد عبد التواب"},  {id:uuidev4(),title:"سَلوانُ قَلب المُؤمن وراحته؛ أنّه في رعايةِ اللّٰه، وبينَ حنايَا لُطفهِ، فما قدّرَهُ كَان، ومَا لم يُقدّره لم يَكُن وكُلّ أقدارهِ خَير.!",yazar:"من أقوال العلماء"},{id:uuidev4(),title:"مَن صَدَقَ تَوكُّلهُ عَلى اللهِ فِي حُصولِ شَيءٍ نَالَهُ.",yazar:"ابن القيّم"},{id:uuidev4(),title:"  لا يصلُحُ حالُ الأمّةِ إلّا إذا صَلَحَ حالُ شَبابها ولن يصلُحَ حالُ شَبابها إلّا بالإسْلام، فاتّقوا الله يا شَبابَ الإسلامِ في أمّتكُم وتمسّكُوا بِعقيدتِكُم.",yazar:"د. عَبد العَزيز الرَّنتِيسِي."},{id:uuidev4(),title:"لو رُزِق العبد الدُّنيا وما فيها ثمَّ قال الحمدُ للّٰه، لكان إلهام اللّٰه له بالحمدِ أعظم نِعمة من إعطائه الدُّنيا؛ ﻷن نعيم الدُّنيا يَزول وثَواب الحمدِ يَبقى.",yazar:"ابن القيّم"},{id:uuidev4(),title:"أعِدَّ نفسَك؛ فلاَ تدرِي مَتىٰ تُسْتَعمَل.",yazar:"الشَّيخ أحمد عبدُالمنعِم."},{id:uuidev4(),title:"أمَّا قبل، فقد رأيتُ عندك الفجر، وأخذت منه نهارًا أحمله في روحي لا يُظلم أبدًا",yazar:"الرافعي"},{id:uuidev4(),title:"ولا يَزال الإنسَان بِخَير مَا عَرف أنّهُ مُذنِب، وأنّه يجِب علَيهِ التّوبة، وأنَّ الله -عَزّ وجل- يقبَل التوبةَ عَن عِبادِه",yazar:"صَالِح العصيمي"},{id:uuidev4(),title:"ألا رُبَّ مشغوفٍ بنا لا ينالُناوآخرَ قد نشقَى بهِ يتباعدُ!",yazar:"أبو نواس"},{id:uuidev4(),title:"الإِنسانُ يتألَّم بالوهَمِ أكثر مما يتألمُ بالحقيقة",yazar:"الرّافعي"},{id:uuidev4(),title:"لَا تَكُنْ شَابَّ البَدَنِ أَشْيَبَ الهِمَّةِ،فَإِنَّ هِمَّةَ الصَّادِقِ لَا تَشِيبُ",yazar:"الشَّيْخُ العُصَيْمِي"},{id:uuidev4(),title:"الله يختارُ لعبدِه عند الإجابة أصلح زمنٍ لا أسرعه.",yazar:"الطريفي"},{id:uuidev4(),title:"أَحسَنَ اللَهُ بِنا أَنْ…الخَطايا لا تَفوحُ…فَإِذا المَستورُ مِنّا…بَينَ ثَوبَيهِ فُضوحُ!",yazar:"أبو العتاهية"},{id:uuidev4(),title:"الإِنسانُ يتألَّم بالوهَمِ أكثر مما يتألمُ بالحقيقة.",yazar:"الرّافعي"},{id:uuidev4(),title:"وإنّما أريدُ وجهك…ولو كنتُ كاذبًا في إرادتي وجهك؛ فارزقني الصدق!",yazar:"الشيخ سمير مصطفى"},  {id:uuidev4(),title:" سَلِ اللّٰهَ أنْ يُحبَّكَ حُبًّا تتجَاوزُ بهِ الحَياةَ حتَّى تنتهِي بكَ وهُو راضٍ عَنكَ، سَلهُ أنْ يُعظِّمَ الرِّضَا فِي صَدرِكَ، واليقِينَ فِي قلبكَ فتغدُو الأمُورُ الشَّديدةُ هيِّنةً عَليكَ!",yazar:"الرَّافعيّ"},{id:uuidev4(),title:"واتّقِ اللهَ فَتقوى اللهِ ما…جاوَرَت قلبَ امرئٍ إلّا وَصَل…ليسَ من يقطعُ طُرْقًا بطلًا…إنّما من يَتّقي الله البطَل.",yazar:"ابن الوردي"}
]
const BootstrapDialog = styled(Dialog)(({ theme }) => ({
  '& .MuiDialogContent-root': {
    padding: theme.spacing(2),
  },
  '& .MuiDialogActions-root': {
    padding: theme.spacing(1),
  },
}));

export default function Home() {
const randomIndex = Math.floor(Math.random() * quotes.length);
  const randomBook = quotes[randomIndex];
    const [open, setOpen] = React.useState(false);

  const handleClickOpen = () => {
    setOpen(true);
  };
  const handleClose = () => {
    setOpen(false);
  };

  return (
    
    <Box sx={{ width: "100%", direction: "rtl" }}>
      {/* Header */}
      <Grid 
        container
        spacing={2}
        alignItems="center"
        justifyContent="space-between"
        sx={{
          p: 2,
          backgroundColor: 'primary.main',
          color: 'white',
          flexWrap: 'wrap'
        }}
      >
        <Grid item xs={12} md="auto">
          <Typography sx={{ fontSize: { xs: 20, md: 28 }, textAlign: { xs: "center", md: "start" } }}>
            أيام تسليم واستلام كتب الاستعارة
          </Typography>
        </Grid>
        <Grid item xs={12} md="auto" sx={{ textAlign: { xs: "center", md: "end" }, mt: { xs: 1, md: 0 } }}>
          <Link to="/Login">
            <Button
              variant="outlined"
              sx={{ color: 'white', fontSize: { xs: 16, md: 20 } ,borderColor:"white" }}
              className='sing'
            >
              تسجيل الدخول
            </Button>
          </Link>
        </Grid>
      </Grid>
      {/* Logo and Title */}
      <Box
        sx={{
          justifyContent: "center",
          display: "flex",
          alignItems: "center",
          color: 'primary.main',
          mt: 5
        }}
      >
        <Box sx={{ display: 'flex', alignItems: 'center', gap: 1, flexWrap: 'wrap' }}>
          <MenuBookOutlinedIcon sx={{ fontSize: { xs: 40, md: 70 } }} />
          <Typography sx={{ fontSize: { xs: 30, md: 50 } }}>
            مكتبة الفرات
          </Typography>
        </Box>
      </Box>
      {/* وصف المكتبة واقتباس */}
      <Box
        sx={{
          justifyContent: 'center',
          display: 'flex',
          alignItems: 'center',
          flexDirection: 'column',
          gap: 3,
          mt: 3,
          px: 2
        }}
      >
        <Typography sx={{ fontSize: { xs: 18, md: 25 }, textAlign: 'center' }}>
          أول مكتبة عربية في مدينة إيلازيغ لإعارة الكتب
        </Typography>

        <Card elevation={8} sx={{ position: 'relative', minHeight: 100, maxWidth: 500, width: "100%" }}>
          <CardContent>
            <Typography gutterBottom sx={{ color: 'primary.main', fontSize: { xs: 18, md: 25 } }}>
              "{randomBook.title}"
            </Typography>
            <Typography
              variant="body2"
              sx={{
                position: 'absolute',
                bottom: 8,
                left: 12,
                fontSize: 14,
                color: 'text.secondary',
              }}
            >
              - {randomBook.yazar} -
            </Typography>
          </CardContent>
        </Card>
      </Box>
      {/* الأزرار */}
      <Box
        sx={{
          justifyContent: 'center',
          display: 'flex',
          flexWrap: 'wrap',
          alignItems: 'center',
          gap: 2,
          mt: 4
        }}
      >   
      <Link to="/Books">
          <Button
            variant="contained"
            sx={{ fontSize: { xs: 16, md: 20 } }}
            className='book'
          >
            استعراض الكتب
          </Button>
        </Link>
        
          <Button
            variant="outlined" onClick={handleClickOpen}
            sx={{ fontSize: { xs: 16, md: 20 }, borderColor: "primary.main" }}
            className='cont'
          >
            تواصل معنا
          </Button>
        {/* </a> */}
      </Box>
    <>
      <BootstrapDialog
  onClose={handleClose}
  aria-labelledby="customized-dialog-title"
  open={open}
  fullWidth // يجعل العرض يأخذ العرض الكامل المتاح
  maxWidth="md" // يمكنك تغييره إلى "lg" أو "xl" حسب الحجم الذي تريدينه
  PaperProps={{
    sx: {
      minHeight: "100px", 
      width: "90%",      
      maxWidth: "500px", 
      mx: "auto",        
    },
  }}
>
  <Box sx={{ direction: "rtl", position: "relative" }}>
    <DialogTitle sx={{ m: 1, p: 2 , fontSize:"24px"}} id="customized-dialog-title" >
      للتواصل معنا
    </DialogTitle>
    <IconButton
    className='sings'
      aria-label="close"
      style={{ marginTop: "12px" }}
      onClick={handleClose}
      sx={(theme) => ({
        position: "absolute",
        left: 8,
        top: 8,
        color: theme.palette.grey[500],
      })}
    >
      <CloseIcon />
    </IconButton>
  </Box>

  <DialogActions>
    <Button size='large' sx={{fontSize:"20px"}}  className='sings' onClick={() => window.open("https://www.instagram.com/firat_bookstore", "_blank")}>
      <InstagramIcon
         style={{
        display: 'inline-flex',
        borderRadius: '75%',
        padding: 2,
        background:
          'linear-gradient(45deg, #FEDA75 0%, #FA7E1E 25%, #D62976 50%, #962FBF 75%, #4F5BD5 100%)',
      }}
        sx={{
          mr: 1,
          color: 'white',  
          width: 24,
          height: 24,
        }}
      />
  عبر الانستغرام
    </Button>

  </DialogActions>
</BootstrapDialog>

    </>
  </Box>    
  );
}

